{
    "socials" : [
        {
            "network": "Facebook",
            "creation": "18-02-2004",
            "changelog": [
                {
                    "feature": "Wirehog",
                    "date": "10-08-2004",
                    "category": "product",
                    "slug": "wirehog",
                    "desc": "To compete with growing campus-only service i2hub, Zuckerberg launches Wirehog. It is a precursor to Facebook Platform applications. "
                },
                {
                    "feature": "Facebook high school version",
                    "date": "10-09-2005",
                    "category": "product",
                    "slug": "facebook high school version",
                    "desc": "Facebook launches a high school version of the website. "
                },
                {
                    "feature": "photos",
                    "date": "25-10-2005",
                    "category": "photos",
                    "slug": "photos",
                    "desc": "Facebook launches its photos feature with no restrictions on storage (but without the ability to tag friends). "
                },
                {
                    "feature": "Tag friends in photos ",
                    "date": "10-12-2005",
                    "category": "photos",
                    "slug": "tag friends in photos ",
                    "desc": "Facebook introduces the ability to tag friends in photos. "
                },
                {
                    "feature": "Facebook notes",
                    "date": "22-08-2006",
                    "category": "blog",
                    "slug": "facebook notes",
                    "desc": "Facebook launches a blogging feature known as 'Facebook Notes'. "
                },
                {
                    "feature": "News Feed",
                    "date": "06-09-2006",
                    "category": "feed",
                    "slug": "news Feed",
                    "desc": "Facebook launches News Feed. The original news feed is an algorithmically generated and constantly refreshing summary of updates about the activities of one's friends. The concept was relatively new at the time, with Twitter having launched only a few months in advance.  "
                },
                {
                    "feature": "Facebook on mobile",
                    "date": "06-09-2006",
                    "category": "smartphone",
                    "slug": "facebook on mobile",
                    "desc": "Facebook launches m.facebook.com and officially announces mobile support. "
                },
                {
                    "feature": "Facebook Platform",
                    "date": "24-05-2007",
                    "category": "for developer",
                    "slug": "facebook Platform",
                    "desc": "Facebook announces Facebook Platform for developers to build applications on top of Facebook's social graph."
                },
                {
                    "feature": "Facebook Credits",
                    "date": "14-11-2008",
                    "category": "in-app purchase",
                    "slug": "facebook Credits",
                    "desc": "Facebook launches Facebook Credits in order to help users purchase Facebook gifts."
                },
                {
                    "feature": "Like button",
                    "date": "09-02-2009",
                    "category": "reacts",
                    "slug": "like",
                    "desc": "Facebook activates the Facebook like button."
                },
                {
                    "feature": "Tag",
                    "date": "10-09-2009",
                    "category": "tag",
                    "slug": "tag",
                    "desc": "Facebook announces a feature whereby people can @-tag friends in their status updates and comments."
                },
                {
                    "feature": "Community Pages",
                    "date": "19-04-2010",
                    "category": "sharing",
                    "slug": "community Pages",
                    "desc": "Facebook introduces Community Pages, which are Pages that are populated with articles from Wikipedia."
                },
                {
                    "feature": "Like on individual comments",
                    "date": "20-06-2010",
                    "category": "reacts",
                    "slug": "like on individual comments",
                    "desc": "Facebook introduces the option to Like individual comments. "
                },
                {
                    "feature": "Profile page",
                    "date": "03-12-2010",
                    "category": "profile",
                    "slug": "profile page",
                    "desc": "Facebook launches a redesign that emphasizes the most important parts of someone's life, including one's biographic information, photos, education, work experience, and important relationships. It replaces the tabs at the top of each profile page with links on the left side of the page"
                },
                {
                    "feature": "Video chat in Facebook's website interface",
                    "date": "06-07-2011",
                    "category": "video chat",
                    "slug": "video chat in Facebook's website interface",
                    "desc": "Facebook partners with Skype to add video chat and updates its website interface."
                },
                {
                    "feature": "Video chat in Facebook's website interface",
                    "date": "06-07-2011",
                    "category": "video chat",
                    "slug": "video chat in Facebook's website interface",
                    "desc": "Facebook partners with Skype to add video chat and updates its website interface."
                },
                {
                    "feature": "Facebook messenger on IOS, Android and Blackberry",
                    "date": "09-08-2011",
                    "category": "facebook messenger",
                    "slug": "facebook messenger on IOS, Android and Blackberry",
                    "desc": "Facebook Messenger is launched for Android and IOS. October 19, 2011 update makes the app available to Blackberry os."
                },
                {
                    "feature": "Character limit update on status from 500 to 63,206",
                    "date": "09-08-2011",
                    "category": "status",
                    "slug": "Character limit update on status",
                    "desc": "Facebook increases the character limit for status update posts from 500 to 5,000 in September and to 63,206 on November 30."
                },
                {
                    "feature": "Subsribe",
                    "date": "14-09-2011",
                    "category": "subscribe",
                    "slug": "subscribe",
                    "desc": "Facebook allows people to subscribe to non-friends and to set the extent to which they receive updates from their existing friends and people they are subscribing to."
                },
                {
                    "feature": "Facebook Platform with Heroku",
                    "date": "14-09-2011",
                    "category": "for developer",
                    "slug": "facebook Platform",
                    "desc": "Facebook partners with Heroku for Facebook application development using the Facebook Platform."
                },
                {
                    "feature": "emoticons",
                    "date": "14-09-2011",
                    "category": "reacts",
                    "slug": "emoticons",
                    "desc": "Facebook rolls out detailed and fine-grained emoticons to express different actions and emotional states in one's status updates (experimental launch January 30, official launch with universal availability April 9)."
                },
                {
                    "feature": "Video Autoplay",
                    "date": "15-04-2013",
                    "category": "video",
                    "slug": "video player",
                    "desc": "Facebook launches a new timeline with Video Autoplay. "
                },
                {
                    "feature": "Stickers",
                    "date": "20-06-2013",
                    "category": "reacts",
                    "slug": "stickers",
                    "desc": "Facebook launches Stickers, initially only for its iOS apps in April, but later expanding to its web version in July."
                },
                {
                    "feature": "Edit posts",
                    "date": "26-09-2013",
                    "category": "status",
                    "slug": "edit posts",
                    "desc": "Facebook begins letting people edit their posts and comments after publishing."
                },
                {
                    "feature": "Trending Topics",
                    "date": "16-01-2014",
                    "category": "trends",
                    "slug": "trending topics",
                    "desc": "Facebook launches Trending Topics for its web version in the US, UK, Canada, India, and Australia. This is based on feedback to a pilot version tested both on the web and mobile starting August 2013."
                },
                {
                    "feature": "Look Back",
                    "date": "04-02-2014",
                    "category": "video",
                    "slug": "look back",
                    "desc": "On February 4, on the occasion of its tenth anniversary, Facebook introduces its Look Back feature that creates an automated video for each person looking back on the person's life as recorded on Facebook. On February 7, Facebook adds the ability to edit the Look Back videos."
                },
                {
                    "feature": "Deep Face",
                    "date": "17-03-2014",
                    "category": "facial recognition",
                    "slug": "facial recongnition",
                    "desc": "Facebook's face recognition algorithm (DeepFace) reaches near-human accuracy in identifying faces."
                },
                {
                    "feature": "Anonymous login",
                    "date": "30-04-2014",
                    "category": "login",
                    "slug": "anonymous login",
                    "desc": "Facebook launches anonymous login so that people can use apps without giving them their data."
                },
                {
                    "feature": "Facebook Slingshot",
                    "date": "18-06-2014",
                    "category": "photos",
                    "slug": "facebook slingshot",
                    "desc": "Facebook releases Facebook Slingshot, an instant messaging software application for sharing photos and videos with friends, for Android and iOS devices."
                },
                {
                    "feature": "Save",
                    "date": "21-07-2014",
                    "category": "feed",
                    "slug": "save",
                    "desc": "Facebook launches Save, a read-it-later feature that allows users to save links, places, and media pages for later perusal."
                },
                {
                    "feature": "Friend-to-friend payment",
                    "date": "17-03-2015",
                    "category": "payment",
                    "slug": "friend-to-friend payment",
                    "desc": "Facebook introduces a free friend-to-friend payment service within its Messenger app. This is touted by some tech journalists as potential competition for PayPal's Venmo service."
                },
                {
                    "feature": "Instant Articles",
                    "date": "12-05-2015",
                    "category": "feed",
                    "slug": "instant articles",
                    "desc": "Facebook launches 'Instant Articles' for Publishers.[312] Publishers who use Instant Articles can opt in to have some of their articles shown to mobile users inside Facebook's app itself, without users having to leave the app and visit the customer's website. Initial launch partners include BuzzFeed, the New York Times, National Geographic and six others. The article as displayed on Facebook mimics the article on the website in terms of layout."
                },
                {
                    "feature": "GIFs",
                    "date": "29-05-2015",
                    "category": "reacts",
                    "slug": "gifs",
                    "desc": "Facebook launches 'Instant Articles' for Publishers.[312] Publishers who use Instant Articles can opt in to have some of their articles shown to mobile users inside Facebook's app itself, without users having to leave the app and visit the customer's website. Initial launch partners include BuzzFeed, the New York Times, National Geographic and six others. The article as displayed on Facebook mimics the article on the website in terms of layout."
                },
                {
                    "feature": "features for facebook business pages",
                    "date": "06-06-2015",
                    "category": "pages",
                    "slug": "pages",
                    "desc": "Facebook adds more features for pages to make it easier for businesses to use them. These include: allowing pages to display how quickly they respond to messages, allowing pages to send saved replies to messages, allowing pages to use private messages for customer support, and adding buy button integration to pages."
                },
                {
                    "feature": "Facebook Live for celebrities",
                    "date": "24-08-2015",
                    "category": "live",
                    "slug": "live-streaming",
                    "desc": "On August 5, Facebook launches live-streaming, initially restricted only to celebrities. Subsequently, on August 12, it announces that the feature will be made available to journalists and those with verified profiles."
                },
                {
                    "feature": "Facebook Live for all in US",
                    "date": "13-01-2016",
                    "category": "live",
                    "slug": "facebook live for all in the US",
                    "desc": "Facebook Live that was originally launched in August 2015 and limited to celebrities, becomes available to all U.S. iPhone users on January 28. On February 18, the global rollout begins. It becomes available to U.S. Android users in the week following February 26. Starting March 1, Facebook starts pushing live content more compared to older content. Commentators describe Facebook Live as marking Facebook's entry into the live-streaming space, competing with Twitter-owned Periscope."
                },
                {
                    "feature": "Facebook Reactions",
                    "date": "24-02-2016",
                    "category": "reacts",
                    "slug": "facebook reactions",
                    "desc": "Facebook releases Facebook Reactions to the general public. The feature allows people to use five additional reactions beyond just the 'like' action to convey their reaction to a post. The new reactions are 'love', 'haha', 'wow', 'sad', and 'anger'.Each user can add at most one reaction to a post."
                },
                {
                    "feature": "Basketball Game",
                    "date": "18-03-2016",
                    "category": "games",
                    "slug": "basketball game",
                    "desc": "Facebook provide 'Basketball Game' function in Messenger."
                },
                {
                    "feature": "Secret soccer game",
                    "date": "15-06-2016",
                    "category": "games",
                    "slug": "secret soccer game",
                    "desc": "Facebook introduces the secret Messenger soccer game, similar to the basketball game."
                },
                {
                    "feature": "Marketplace",
                    "date": "03-08-2016",
                    "category": "in-app purchase",
                    "slug": "marketplace",
                    "desc": "In the US, UK, Australia, and New Zealand, Facebook launches Marketplace, a way to buy and sell items through Facebook. Marketplace appears as a tab in the mobile app. The feature has been compared to Craigslist."
                },
                {
                    "feature": "Reactions and mentions inside Messenger",
                    "date": "23-03-2017",
                    "category": "reacts, tag",
                    "slug": "reactions and mentions inside Messenger",
                    "desc": "Facebook adds reactions and mentions inside Messenger (both the app and the web experience)."
                },
                {
                    "feature": "Reactions to comments",
                    "date": "03-05-2017",
                    "category": "reacts",
                    "slug": "reactions to comments",
                    "desc": "Facebook adds reactions to comments. Reactions were previously available on messages (sent via Messenger) and Facebook posts but not in comments."
                },
                {
                    "feature": "Facebook Creator",
                    "date": "16-11-2017",
                    "category": "video",
                    "slug": "facebook creator",
                    "desc": "After live videos having skyrocketed on Facebook in the last months, the social network launches Facebook Creator, an app for mobile video posts offering influencers Live Creative Kit for adding intros and outros to broadcasts, a unified inbox of Facebook and Instagram comments plus Messenger chats, cross-posting to Twitter and expansive analytics."
                },
                {
                    "feature": "Messenger Kids",
                    "date": "04-12-2017",
                    "category": "facebook messenger",
                    "slug": "messenger kids",
                    "desc": "Facebook launches Messenger Kids, a version of Messenger for children from ages six to 12. The app does not require a Facebook account (illegal for this range of age). Rather, parents are able to manage a child’s Messenger Kids app from their Facebook account, controlling which friends and family members the child is able to contact."
                }
            ]
        },
        {
            "network": "Twitter",
            "creation": "01-03-2006",
            "changelog": [
                {
                    "feature": "Creation of hashtags",
                    "date": "23-08-2007",
                    "category": "tag",
                    "slug": "",
                    "desc": "The hashtag (#), first proposed by user Chris Messina, debuts on Twitter."
                },
                {
                    "feature": "Promoted tweets",
                    "date": "13-04-2010",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Twitter announces that it will start allowing for advertising in the form of promoted tweets – \"ordinary tweets that businesses and individuals want to highlight to a wider group of users.\""
                },
                {
                    "feature": "New homepage",
                    "date": "20-04-2011",
                    "category": "layout",
                    "slug": "",
                    "desc": "Twitter tests a new homepage and phased out the \"Old Twitter.\" [40] However, a glitch came about after the page was launched, so the previous \"retro\" homepage was still in use until the issues were resolved; the new homepage was reintroduced on April 20."
                },
                {
                    "feature": "Feed layout",
                    "date": "08-12-2011",
                    "category": "layout",
                    "slug": "",
                    "desc": "Twitter overhauls its website once more to feature the \"Fly\" design, which the service says is easier for new users to follow and promotes advertising. In addition to the Home tab, the Connect and Discover tabs are introduced along with a redesigned profile and timeline of Tweets. The site's layout is compared to that of Facebook. "
                },
                {
                    "feature": "Embeded Twitter content in search engines",
                    "date": "21-02-2012",
                    "category": "search_engine",
                    "slug": "",
                    "desc": "Twitter announces a partnership with Russian search engine Yandex. Yandex, a Russian search engine, finds value within the partnership due to Twitter's real time news feeds. Twitter's director of business development explained that it is important to have Twitter content where Twitter users go."
                },
                {
                    "feature": "Twitter Music",
                    "date": "18-04-2013",
                    "category": "app",
                    "slug": "",
                    "desc": "Twitter launches a music app called Twitter Music for the iPhone."
                },
                {
                    "feature": "New anti-harassment tools & responses",
                    "date": "02-12-2014",
                    "category": "moderation",
                    "slug": "harassment",
                    "desc": "Twitter announces a new suite of anti-harassment tools and promises faster response times for abuse complaints."
                },
                {
                    "feature": "Instant Timeline",
                    "date": "12-11-2014",
                    "category": "feed",
                    "slug": "",
                    "desc": "Twitter announces  \"Instant Timeline\"—a way to show users who have just created accounts interesting content even before they have followed anybody. Around the same time, Twitter announces that it will make the timeline more customized, highlighting to a user the most important tweets while they were away, rather than simply showing a reverse chronological feed. Other features announced include better video capability and the ability to share public tweets privately with one's followers to discuss them."
                },
                {
                    "feature": "While you were away",
                    "date": "21-01-2015",
                    "category": "content",
                    "slug": "",
                    "desc": "Twitter officially launches its \"While You Were Away\" feature."
                },
                {
                    "feature": "Quality filter on iOS users",
                    "date": "23-03-2015",
                    "category": "moderation",
                    "slug": "",
                    "desc": "Twitter starts rolling out a \"Quality Filter\" to verified iOS users so that people can more easily keep bullying and unpleasant tweets out of their stream. A number of news articles commented that it worked quite well."
                },
                {
                    "feature": "Curator",
                    "date": "31-03-2015",
                    "category": "search_engine",
                    "slug": "",
                    "desc": "Twitter publicly launches Curator, a real-time search and filtering feature for media outlets, that some commentators call a Storify competitor."
                },
                {
                    "feature": "Marketing Platform Partners",
                    "date": "05-03-2015",
                    "category": "advertising",
                    "slug": "",
                    "desc": "Twitter announces that it will tap data from its Marketing Platform Partners and allow publishers to target ads to specific audiences based on that data."
                },
                {
                    "feature": "Displaying tweets in Google Search",
                    "date": "19-05-2015",
                    "category": "search_engine",
                    "slug": "",
                    "desc": "Google adds tweets to its mobile search results."
                },
                {
                    "feature": "Buy buttons",
                    "date": "30-09-2015",
                    "category": "in-app_shopping",
                    "slug": "",
                    "desc": "Twitter expands Buy buttons through partnerships with Bigcommerce, Demandware, and Shopify."
                },
                {
                    "feature": "Twitter Moments",
                    "date": "06-10-2015",
                    "category": "trends",
                    "slug": "",
                    "desc": "Twitter debuts Twitter Moments, a way for people to get a quick overview of important tweets or chains of tweets that occurred recently."
                },
                {
                    "feature": "Replacement of Favorite button",
                    "date": "03-11-2015",
                    "category": "react",
                    "slug": "",
                    "desc": "Twitter replaces the Favorite button with a Like button and the star symbol (used to symbolize favoriting) with a heart symbol. Twitter reports a 6% increase in usage of the feature after the change, and also appears to be experimenting with offering a more diverse set of emojis, prompting commentators to draw parallels with Facebook's Reactions feature."
                },
                {
                    "feature": "Transparency page",
                    "date": "04-11-2015",
                    "category": "transparency",
                    "slug": "",
                    "desc": "Twitter launches a political transparency page, so that people can better engage with policy issues on Twitter."
                },
                {
                    "feature": "Algorithmic feed based on recommended tweets",
                    "date": "20-03-2016",
                    "category": "feed",
                    "slug": "",
                    "desc": "Twitter rolls out a change to its feed, making recommended tweets the default option, rather than the reverse chronological format that it had used since launch. The rollout officially begins on February 10. The rollout is completed on March 17, 2016. Users are allowed to opt out, but Twitter reports in April 2016 that the percentage of users who opted out is in the \"low single digits\"."
                }, 
                {
                    "feature": "External content in tweets",
                    "date": "24-05-2016",
                    "category": "content",
                    "slug": "",
                    "desc": "Twitter announces that photos, videos, and the person's handle will not be counted in the 140 characters, and that a tweet beginning with a handle will be seen by followers."
                },
                {
                    "feature": "Located tweets",
                    "date": "24-06-2016",
                    "category": "meta",
                    "slug": "",
                    "desc": "Twitter launches tags to location feeds with Foursquare. People can see which tweets are from a specific place."
                },
                {
                    "feature": "Explore tab",
                    "date": "26-01-2017",
                    "category": "layout",
                    "slug": "",
                    "desc": "Twitter launches the \"Explore\" tab, which replaces the \"Moments\" tab. The Explore tab bundles together Moments, trends, live video streams, and search."
                },
                {
                    "feature": "Caracters limit in tweets increased",
                    "date": "06-11-2018",
                    "category": "content",
                    "slug": "",
                    "desc": "Twitter expands from 140 to 280-word count."
                }
            ]
        },
        {
            "network": "Instagram",
            "creation": "21-10-2009",
            "changelog": [
                {
                    "feature": "Image post",
                    "date": "22-06-2010",
                    "category": "photo",
                    "slug": "post",
                    "desc": "Instagram launches (from Systrom and Krieger) with the hope of facilitating communication through images. It nabs 100K users in one week."
                },
                {
                    "feature": "Hashtags",
                    "date": "01-01-2011",
                    "category": "tag",
                    "slug": "reacts",
                    "desc": "Instagram adds hashtags to help users discover both photographs and each other. Instagram encourages users to make tags both specific and relevant, rather than tagging generic words like \"photo\", to make photographs stand out and to attract like-minded Instagram users."
                },
                {
                    "feature": "Filters on camera",
                    "date": "01-09-2012",
                    "category": "photo",
                    "slug": "filter",
                    "desc": "Version 2.0 of Instagram goes live in the App Store (iOS) and included new and live filters"
                },
                {
                    "feature": "Tilt-shift on camera",
                    "date": "01-09-2012",
                    "category": "photo",
                    "slug": "filter",
                    "desc": "Version 2.0 of Instagram goes live in the App Store (iOS) and instant tilt–shift"
                },
                {
                    "feature": "High resolution on camera",
                    "date": "01-09-2012",
                    "category": "photo",
                    "slug": "filter",
                    "desc": "Version 2.0 of Instagram goes live in the App Store (iOS) and high resolution photographs"
                },
                {
                    "feature": "Optional borders on camera",
                    "date": "01-09-2012",
                    "category": "photo",
                    "slug": "filter",
                    "desc": "Version 2.0 of Instagram goes live in the App Store (iOS) and optional borders"
                },
                {
                    "feature": "One-click rotation on pictures editing",
                    "date": "01-09-2012",
                    "category": "photo",
                    "slug": "filter",
                    "desc": "Version 2.0 of Instagram goes live in the App Store (iOS) and one-click rotation"
                },
                {
                    "feature": "Photo user tagging",
                    "date": "01-05-2013",
                    "category": "photo",
                    "slug": "tag",
                    "desc": "Instagram introduces photo tagging and \"Photos of You,\" a new tab on a user’s profile listing every picture he or she is tagged in."
                },
                {
                    "feature": "Video sharing",
                    "date": "13-06-2013",
                    "category": "video",
                    "slug": "tag",
                    "desc": "Instagram launches video sharing."
                },
                {
                    "feature": "Embed links",
                    "date": "01-07-2013",
                    "category": "share",
                    "slug": "link",
                    "desc": "Instagram makes it easier to share posts by adding links to embed photos and videos."
                },
                {
                    "feature": "Sponsored post",
                    "date": "01-11-2013",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Instagram introduces sponsored post advertising targeting US users."
                },
                {
                    "feature": "Send photos",
                    "date": "12-12-2013",
                    "category": "messaging",
                    "slug": "messaging",
                    "desc": "Instagram adds Direct, a feature that allows users to send photos to specific people directly from the app. Instagram's primary intention with the Direct feature is to compete against messaging services, including Snapchat."
                },
                {
                    "feature": "Advanced editing tools",
                    "date": "01-07-2014",
                    "category": "photo",
                    "slug": "edit",
                    "desc": "Instagram launches new series of editing tools – allowing users to minutely customize image characteristics like brightness, contrast, highlights, and shadows."
                },
                {
                    "feature": "advanced business tools",
                    "date": "21-09-2014",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Instagram makes itself more advertising-friendly by introducing a suite of business tools aimed at brands which offer insights and analytics related to their use of the image-sharing network."
                },
                {
                    "feature": "Call to action on advertising",
                    "date": "01-07-2015",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Instagram bolsters up its advertising capabilities, testing ad formats that prompt users to do things such as installing an app, signing up for an email newsletter, or link to a retailer’s site to purchase a product."
                },
                {
                    "feature": "30-second videos for advertisers",
                    "date": "09-09-2015",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Instagram allows 30-second ads for all advertisers – twice the 15-second limit given for users."
                },
                {
                    "feature": "Boomerang video",
                    "date": "01-10-2015",
                    "category": "filter",
                    "slug": "filter",
                    "desc": "Instagram launches Boomerang, an app where the user shoots a one-second burst of five photos that is turned into a silent video that plays forwards and then reverses in a loop."
                },
                {
                    "feature": "Disabled feed reading API",
                    "date": "17-11-2015",
                    "category": "dev",
                    "slug": "dev",
                    "desc": "Instagram kills off support from feed-reading applications."
                },
                {
                    "feature": "Switch between multiple accounts",
                    "date": "01-02-2016",
                    "category": "dev",
                    "slug": "dev",
                    "desc": "Instagram starts enabling users to easily switch between multiple accounts."
                },
                {
                    "feature": "Algorithmically-driven Feed",
                    "date": "15-03-2016",
                    "category": "feed",
                    "slug": "feed",
                    "desc": "Instagram switches its feed from chronological to algorithmically-driven best posts first."
                },
                {
                    "feature": "Analytics on profile",
                    "date": "01-05-2016",
                    "category": "data",
                    "slug": "data",
                    "desc": "Instagram announces that it will launch new business tools – including analytics that allow users to see audience demographics, post impressions, and reach."
                },
                {
                    "feature": "Instant translation",
                    "date": "01-06-2016",
                    "category": "data",
                    "slug": "data",
                    "desc": "Instagram announces instant translation feature."
                },
                {
                    "feature": "Comment filter",
                    "date": "01-07-2016",
                    "category": "comment",
                    "slug": "comment",
                    "desc": "Instagram announces that it will start allowing users to filter out comment streams – giving users the choice about which comments are acceptable or not for themselves. It also starts allowing users the opportunity to entirely turn off comments."
                },
                {
                    "feature": "Instagram Stories",
                    "date": "02-08-2016",
                    "category": "stories",
                    "slug": "stories",
                    "desc": "Instagram launches Instagram Stories. The product works like Snapchat Stories: users can post 24-hour ephemeral photo and video slideshows that disappear. Instagram CEO Kevin Systrom openly admits that the feature is copied from Snapchat, based on the success of Snapchat stories. The feature is viewed as part of Instagram's goal of attracting users away from Snapchat."
                },
                {
                    "feature": "Image Zoom",
                    "date": "02-08-2016",
                    "category": "image",
                    "slug": "image",
                    "desc": "Instagram brings in Image Zoom, allowing users to zoom into images."
                },
                {
                    "feature": "Live Video",
                    "date": "21-11-2016",
                    "category": "live",
                    "slug": "live",
                    "desc": "Instagram launches live video, which allows users to broadcast live on Instagram, for up to one hour. Live videos on Instagram are not preserved, and are removed from the service once a user is done broadcasting. Instagram also launches disappearing photos and videos for the Instagram Direct feature on the same day, and images and videos sent using this method disappear after a certain amount of time."
                },
                {
                    "feature": "Slides posts",
                    "date": "22-02-2017",
                    "category": "posts",
                    "slug": "posts",
                    "desc": "Instagram launches a feature allowing users to post multiple photos in one post, in a slideshow-like fashion."
                },
                {
                    "feature": "IGTV",
                    "date": "20-06-2018",
                    "category": "video",
                    "slug": "video",
                    "desc": "Instagram announces the launch of IGTV, a video platform intended to compete against YouTube. Users will now be able to upload videos of up to 10 minutes, while creators and accounts with larger audiences can upload videos of up to one hour. IGTV will have a dedicated button in the Instagram app, in addition to a standalone app released that same day."
                }
            ]
        },
        {
            "network": "Snapchat",
            "creation": "01-04-2011",
            "changelog": [
                {
                    "feature": "Video sharing",
                    "date": "14-12-2012",
                    "category": "video",
                    "slug": "video",
                    "desc": "Snapchat releases video sharing and begins prototyping monetization features."
                },
                {
                    "feature": "Snapchat Micro",
                    "date": "09-09-2013",
                    "category": "responsive",
                    "slug": "responsive",
                    "desc": "Snapchat releases Snapchat Micro, an app for the Galaxy Gear smartwatch."
                },
                {
                    "feature": "Snapchat Stories",
                    "date": "03-10-2013",
                    "category": "stories",
                    "slug": "stories",
                    "desc": "Snapchat updates its app to include the option to create Snapchat Stories, a type of sharing that allows users to build chains of shared content that can be viewed an unlimited number of times over a 24-hour period."
                },
                {
                    "feature": "Text chat and video calling",
                    "date": "01-05-2014",
                    "category": "messaging",
                    "slug": "messaging",
                    "desc": "Snapchat adds ephemeral text chat and video calling."
                },
                {
                    "feature": "Collaboratives Stories",
                    "date": "17-06-2014",
                    "category": "stories",
                    "slug": "stories",
                    "desc": "Snapchat launches collaborative timelines based on events."
                },
                {
                    "feature": "Snapchat Live",
                    "date": "29-08-2014",
                    "category": "live",
                    "slug": "live",
                    "desc": "Snapchat updates its app, adding a \"Live\" section that allows people to follow events live."
                },
                {
                    "feature": "Snapcash",
                    "date": "17-11-2014",
                    "category": "money",
                    "slug": "money",
                    "desc": "Snapchat announces Snapcash, a tool allowing people to send each other money easily through the app."
                },
                {
                    "feature": "Sponsored Story",
                    "date": "23-11-2014",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Snapchat includes a sponsored story from Samsung and the AMAs in its Our Story section. Although Snapchat has previously included topical stories related to the World Cup and Super Bowl in the Our Stories section, this is the first placement paid for by a brand."
                },
                {
                    "feature": "Snapchat Discover",
                    "date": "27-01-2015",
                    "category": "feed",
                    "slug": "feed",
                    "desc": "Snapchat launches Discover, a daily feed comprising content from brands like ESPN, CNN, Vice, and Warner Music, National Geographic, Yahoo News, and others."
                },
                {
                    "feature": "Video Update",
                    "date": "01-07-2015",
                    "category": "video",
                    "slug": "video",
                    "desc": "Snapchat changes its interface to no longer require people to tap and hold to watch. They just need to tap to the relevant video. This move is interpreted as being an adaptation to the increasing length of video content being shared, that makes holding down more and more cumbersome. A number of other accompanying changes are made, including allowing people to have a profile GIF: they can take five photos of themselves and an animated GIF will be created by juxtaposing the five images."
                },
                {
                    "feature": "Snapchat Travel Mode",
                    "date": "12-08-2015",
                    "category": "data",
                    "slug": "data",
                    "desc": "Snapchat launches a new mode called Travel Mode in its iOS and Android apps, intended for people who are traveling and do not want to use too much mobile data. In this mode, Snaps, Stories, and Discovery content are not automatically loaded when the user opens the app, but are only loaded when the user taps on the piece of content."
                },
                {
                    "feature": "\"Snapchat Channel\"",
                    "date": "12-10-2015",
                    "category": "content",
                    "slug": "content",
                    "desc": "Snapchat gets rid of its 15-person team running the \"Snapchat Channel\" (its original content) and shuts the product down."
                },
                {
                    "feature": "Slow-Mo, Fast-forward and rewind video filters",
                    "date": "28-10-2015",
                    "category": "video",
                    "slug": "video",
                    "desc": "Snapchat adds slow-mo, fast-forward and rewind video filters. It also adds 3D touch capabilities for iPhone 6S and iPhone 6S+ users."
                },
                {
                    "feature": "Chat 2.0",
                    "date": "29-03-2016",
                    "category": "messaging",
                    "slug": "messaging",
                    "desc": "Snapchat announces Chat 2.0, a collection of product updates. The updates include Snapchat Stories auto-advance (moving to the next story after one story has played), over 200 stickers that can be used in chat messages, video notes, audio notes, video and audio calls, multiple photo-sending, and on-the-fly toggling between video and audio calls.[107][108] Commentators find a connection between the announcements, arguing that the acquisition of Bitstrips might lead to the ability to create and send personalized stickers in the future."
                },
                {
                    "feature": "Editing",
                    "date": "23-05-2016",
                    "category": "edit",
                    "slug": "edit",
                    "desc": "Snapchat adds support for decorating snaps with 200+ stickers."
                },
                {
                    "feature": "Snapchat Memories",
                    "date": "23-07-2016",
                    "category": "stories",
                    "slug": "stories",
                    "desc": "Snapchat announces Memories, a feature that helps people find older content they have posted. By default, any snaps saved to the Camera Roll also get included in Memories, though the setting can be changed. It is also possible to search through old snaps in Memories. Memories itself cannot be accessed by others, but snaps collected from memories can be used as part of Snapchat Stories, that others can see temporarily. This also makes it easy for people to recover their snaps if their device is lost or damaged. Particularly sensitive content can be saved under My Eyes Only with passcode protection, but the content cannot be retrieved if the passcode is lost."
                },
                {
                    "feature": "Snap Map",
                    "date": "21-06-2017",
                    "category": "stories",
                    "slug": "stories",
                    "desc": "Snapchat launches location sharing with a new feature called Snap Map. Snap Map lets you share your current location, which appears to friends on a map and updates when you open Snapchat."
                }


            ]
        },
        {
            "network": "Pinterest",
            "creation": "01-12-2009",
            "changelog": [
                {
                    "feature": "Embed links",
                    "date": "20-02-2012",
                    "category": "share",
                    "slug": "link",
                    "desc": "Pinterest releases a \"nopin\" HTML meta tag that allowed websites to opt out of allowing their content to be pinned.[9] Soon (February 24), Flickr implements the code to allow users to opt out of allowing their photos to be pinned."
                },
                {
                    "feature": "Pinterest adds automatic attribution",
                    "date": "01-05-2012",
                    "category": "share",
                    "slug": "link",
                    "desc": "Pinterest adds automatic attribution of authors on images originating from Flickr, Behance, YouTube, and Vimeo. Automatic attribution is also added for Pins from sites mirroring content on Flickr. At the same time Flickr added a Pin shortcut to its share option menu to users who have not opted out of sharing their images."
                },
                {
                    "feature": "Pinterest launches business accounts",
                    "date": "14-10-2012",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Pinterest launches business accounts allowing businesses to either convert their existing personal accounts into business accounts, or start from scratch."
                },
                {
                    "feature": "Allow users to report others",
                    "date": "17-10-2012",
                    "category": "moderation",
                    "slug": "moderation",
                    "desc": "Pinterest announces a new feature that would allow users to report others for negative and offensive activity or block other users if they do not want to view their content. Pinterest said they want to keep their community \"positive and respectful.\""
                },
                {
                    "feature": "Guided Search",
                    "date": "24-10-2014",
                    "category": "search_engine",
                    "slug": "search_engine",
                    "desc": "Pinterest announces and releases Guided Search, a new visual way to explore Pinterest's more than 30 billion pins—links or images chosen by users and assigned by them to topical collections."
                },
                {
                    "feature": "Promoted Pins",
                    "date": "12-05-2014",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Pinterest launches \"Promoted Pins\" that would allow companies to sponsor results in its search results and category feeds."
                },
                {
                    "feature": "Direct Messaging",
                    "date": "06-08-2014",
                    "category": "messaging",
                    "slug": "messaging",
                    "desc": "Pinterest adds a direct messaging feature that allows users to discuss pins privately."
                },
                {
                    "feature": "Analytics dashboard",
                    "date": "26-08-2014",
                    "category": "analytics",
                    "slug": "analytics",
                    "desc": "Pinterest launches a new analytics dashboard for business users."
                },
                {
                    "feature": "Pin Picks",
                    "date": "06-10-2014",
                    "category": "content",
                    "slug": "content",
                    "desc": "Pinterest releases \"Pin Picks\" that are weekly curations of their own content."
                },
                {
                    "feature": "Promoted pins to all advertisers",
                    "date": "28-12-2014",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Pinterest opens up promoted pins to all advertisers, following what they perceive as success of their beta program."
                },
                {
                    "feature": "New search filters",
                    "date": "23-01-2015",
                    "category": "search_engine",
                    "slug": "search_engine",
                    "desc": "Pinterest debuts new search filters that give users more control over the pins they see. Commentators believe the aim of these is to go after the male demographic, which tends to be put off by the female-heavy pins on the site."
                },
                {
                    "feature": "Promoted Pins in users' home feeds",
                    "date": "27-01-2015",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Pinterest announces that it will begin showing Promoted Pins in users' home feeds, thereby expanding the reach of Promoted Pins considerably."
                },
                {
                    "feature": "Direct Download",
                    "date": "11-02-2015",
                    "category": "data",
                    "slug": "data",
                    "desc": "Pinterest announces a partnership with Apple Inc. whereby people using Pinterest's iOS app on iPhones or iPads can directly download iOS apps from within Pinterest itself, using special types of pins called app Pins."
                },
                {
                    "feature": "Pin It Button",
                    "date": "02-04-2015",
                    "category": "layout",
                    "slug": "layout",
                    "desc": "Pinterest debuts a new \"Pin It\" button that requires fewer steps to bookmark a Pin, and that, according to tests, increases the number of pinning actions by 3%. The new button is developed by the team from Icebergs, a company acquired by Pinterest the previous year."
                },
                {
                    "feature": "Cinematic Pins",
                    "date": "18-05-2015",
                    "category": "video",
                    "slug": "video",
                    "desc": "Pinterest introduces a new video ad format called Cinematic Pins, where the video plays only either while the user is scrolling or if the user taps on the pin. This is in contrast with existing autoplay videos used by Facebook and other companies for their feeds."
                },
                {
                    "feature": "Buyable Pins",
                    "date": "18-05-2015",
                    "category": "advertising",
                    "slug": "advertising",
                    "desc": "Pinterest announces the launch of Buyable Pins, a special type of pin that can be used to make purchases within Pinterest itself. When users select a Buyable Pin, they have the option of choosing the item they wish to buy (for instance, choosing between different dress sizes and colors), and they can then make the purchase within the app using a variety of payment methods, including Apple Pay. Launch partners include Shopify and Demandware. The buyable pins are free to use, and Pinterest does not take a cut of the purchases made. However, Pinterest intends to allow sellers to promote buyable pins just as they can promote other pins."
                },
                {
                    "feature": "Visual search",
                    "date": "08-11-2015",
                    "category": "search_engine",
                    "slug": "search_engine",
                    "desc": "Pinterest begins rolling out a visual search tool that allows users to select part of an image and find similar Pins."
                },
                {
                    "feature": "Video player",
                    "date": "01-08-2016",
                    "category": "video",
                    "slug": "video",
                    "desc": "Pinterest launches a video player that lets users and brands upload and store clips of any length straight to the site. It also begins implementing visual search tools on videos."
                },
                {
                    "feature": "Tried it checkmark",
                    "date": "10-11-2016",
                    "category": "layout",
                    "slug": "layout",
                    "desc": "Pinterest begins showing a \"Tried it\" checkmark on Pins, which allows users to share the products, recipes, and ideas they have tried."
                },
                {
                    "feature": "Lens, Instant Ideas and Shop the Look",
                    "date": "07-02-2017",
                    "category": "search_engine",
                    "slug": "search_engine",
                    "desc": "Pinterest simultaneously launches three products related to visual search: (1) Lens, which allows users to take photos of objects to find Pins related those objects; (2) Instant Ideas, a circle button that appears on each Pin that, when tapped, displays related Pins; and (3) Shop the Look, a circle button that appears on each individual item within a photo that, when tapped, displays Pins related to that item."
                }

            ]
        },
        {
            "network": "Youtube",
            "creation": "14-02-2005",
            "changelog": [
                {
                    "feature": "HTML embedding videos",
                    "date": "06-07-2005",
                    "category": "for developer",
                    "slug": "",
                    "desc": ""
                },
                {
                    "feature": "Top videos page",
                    "date": "22-07-2005",
                    "category": "layout",
                    "slug": "",
                    "desc": ""
                },
                {
                    "feature": "Rating system",
                    "date": "17-08-2005",
                    "category": "reacts",
                    "slug": "",
                    "desc" : "Add a 5-star rating system"
                },
                {
                    "feature": "Playlists",
                    "date": "07-10-2005",
                    "category": "content",
                    "slug": "",
                    "desc" : "Add the possibility to users to create playlists of videos and play it in following."
                },
                {
                    "feature": "Fullscreen view",
                    "date": "22-10-2005",
                    "category": "layout",
                    "slug": "",
                    "desc": "Videos can now be seen in fullscreen !"
                },
                {
                    "feature": "Subscriptions",
                    "date": "31-10-2005",
                    "category": "content",
                    "slug": "",
                    "desc": "Users can subscribe to channels of other users."
                },
                {
                    "feature": "Personalization of profiles",
                    "date": "31-12-2005",
                    "category": "profile",
                    "slug": "",
                    "desc": "Users can add a banner, a photo profile, description and other links in bio of their profile."
                },
                {
                    "feature": "Time limit extended",
                    "date": "02-02-2006",
                    "category": "video",
                    "slug": "",
                    "desc": "Videos can now last 10 minutes."
                },
                {
                    "feature": "Comments",
                    "date": "02-05-2006",
                    "category": "reacts",
                    "slug": "",
                    "desc": "Users can react to videos in comments."
                },
                {
                    "feature": "Upload from cell phones",
                    "date": "02-07-2006",
                    "category": "content",
                    "slug": "",
                    "desc": "Add the possibility to upload from cell phones in roaming."
                },
                {
                    "feature": "History",
                    "date": "02-09-2006",
                    "category": "content",
                    "slug": "",
                    "desc": "Store an history of videos viewed."
                },
                {
                    "feature": "480p quality",
                    "date": "02-03-2008",
                    "category": "video",
                    "slug": "",
                    "desc": "Increase the maximum quality to 480p."
                },
                {
                    "feature": "Video analytics",
                    "date": "22-03-2008",
                    "category": "content",
                    "slug": "",
                    "desc": "Users can monitor the activity of their channel thanks to a new analytic statistic tool."
                },
                {
                    "feature": "720p quality",
                    "date": "22-07-2009",
                    "category": "video",
                    "slug": "",
                    "desc": "Increase the maximum quality to 720p."
                },
                {
                    "feature": "1080p quality",
                    "date": "13-11-2009",
                    "category": "video",
                    "slug": "",
                    "desc": "Increase the maximum quality to 1080p."
                },
                {
                    "feature": "Automatic speech recognition",
                    "date": "18-12-2009",
                    "category": "video",
                    "slug": "",
                    "desc": "Subtitles can be displayed on the bottom on the video. Translations are processed by a an speech-to-text algorithm."
                },
                {
                    "feature": "Vevo",
                    "date": "29-12-2009",
                    "category": "content",
                    "slug": "",
                    "desc": "Officials musical artists are granted to VEVO channels. It offers many advantages in promoting, advertising, and provides a \"label\" to ensure authenticity of the author."
                },
                {
                    "feature": "Thumbs rating system",
                    "date": "05-03-2010",
                    "category": "reacts",
                    "slug": "",
                    "desc": "Rating system is changed to a boolean new one : thumb up or thumb down, green thumb or red thumb."
                },
                {
                    "feature": "4K quality",
                    "date": "12-07-2010",
                    "category": "video",
                    "slug": "",
                    "desc": "Increase the maximum quality to 4K."
                },
                {
                    "feature": "60 fps quality",
                    "date": "12-10-2014",
                    "category": "video",
                    "slug": "",
                    "desc": "Videos can be seen in 60 fps (before was 30fps)."
                },
                {
                    "feature": "360 videos",
                    "date": "02-03-2015",
                    "category": "video",
                    "slug": "",
                    "desc": "Youtube support now the 360 videos. It ables to drag on the video to move the direction of the camera."
                },
                {
                    "feature": "Youtube RED",
                    "date": "02-11-2015",
                    "category": "content",
                    "slug": "",
                    "desc": ""
                },
                {
                    "feature": "Increase of ads before videos",
                    "date": "02-10-2019",
                    "category": "advertising",
                    "slug": "",
                    "desc": "Up to two ads can be seen before videos. Youtube is one the more restrictive plateforms about skipping ads. Users can't skip some ads that last 12 seconds or some that last 30 seconds."
                }
            ]
        }
    ],
    "eras": {
        "forum": "28-06-2005",
        "blog": "28-06-2006",
        "photo": "28-06-2008",
        "live": "28-06-2009"
    }
}

